# GetRightSupports Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsRun..::..GetRightSupports Method
StairsRun Class See Also
---
Retrieves all supports on the right side of run boundaries.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<ElementId> GetRightSupports()
```

Visual Basic
---
```text
Public Function GetRightSupports As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetRightSupports()
```

# ### Return Value
The supports on the right side of run boundaries.
# See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace